In [9]:
import pandas as pd
from google.colab import drive
drive.mount('/content/drive')
# follow the link it generates, choose your NYU account, and then paste in the authorization code it provides
df = pd.read_csv('/content/drive/My Drive/Data for Python/zoo.csv',
header='infer')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [31]:
df = pd.read_csv('/content/drive/My Drive/Data for Python/zoo.csv', header='infer')
df.head(7)

     animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
3     tiger     1004         300
4     tiger     1005         320
5     tiger     1006         330
6     tiger     1007         290